In [1]:
import numpy as np 
import pandas as pd

In [2]:
data={'Copany':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Venessa','Carl','Sarrah'],
     'Sales':[220,120,340,124,243,350]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

  Copany   Person  Sales
0   GOOG      Sam    220
1   GOOG  Charlie    120
2   MSFT      Amy    340
3   MSFT  Venessa    124
4     FB     Carl    243
5     FB   Sarrah    350

In [7]:
df.groupby

<bound method NDFrame.groupby of   Copany   Person  Sales
0   GOOG      Sam    220
1   GOOG  Charlie    120
2   MSFT      Amy    340
3   MSFT  Venessa    124
4     FB     Carl    243
5     FB   Sarrah    350>

In [13]:
 nextres=df.groupby('Copany')

In [14]:
nextres.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [16]:
nextres.max().Sales

Copany
FB      350
GOOG    220
MSFT    340
Name: Sales, dtype: int64

In [9]:
df.describe()

            Sales
count    6.000000
mean   232.833333
std    100.056817
min    120.000000
25%    148.000000
50%    231.500000
75%    315.750000
max    350.000000